[
    {
        "_id": "01",
        "title": "Book Shop",
        "live": "https://assignment-12-49fd8.web.app/",
        "client": "https://github.com/grsagor/online-book-shop-client",
        "server": "https://github.com/grsagor/online-book-shop-server",
        "imgs": [
            "https://i.ibb.co/X5c06Gg/1.png",
            "https://i.ibb.co/zPcxqLt/2.png",
            "https://i.ibb.co/J29zQLD/3.png"
        ],
        "thumbnail": "https://i.ibb.co/NLcqMVc/book-shop-thumbnail.jpg",
        "shortDescriptions": [
            "Buyers can book the books.",
            "Seller can add book.",
            "Jwt token explored"
        ],
        "detailDescriptions": [
            "In this website, I have successfully explored different dashboard interface for users with different role where they are able to do different activities based on their role.",
            "Users can add images directly and the pictures will be store into a medium and a link of the image will be stored into database.",
            "A special feature of verified users has explored in this website where the authority can verify a user and some action also made on this feature such as showing blue tick with the verified users.",
            "Admin can verify a seller. If a seller is verified then every time when the name of the seller is showing, there will be a blue tick after the name.",
            "When a buyer is trying to book a book, a modal will be opened where some information of the specific book will be shown on the modal."
        ]
    },

    {
        "_id": "02",
        "title": "University Of Music",
        "live": "https://assignment-11-c14cb.web.app/",
        "client": "https://github.com/grsagor/university-of-music-client",
        "server": "https://github.com/grsagor/university-of-music-server",
        "imgs": [
            "https://i.ibb.co/9GcVwjp/1.png",
            "https://i.ibb.co/hL2zLQK/2.png",
            "https://i.ibb.co/J2LFVVL/3.png"
        ],
        "thumbnail": "https://i.ibb.co/z8M99sS/uom-1670763363781.jpg",
        "shortDescriptions": [
            "Limit uses in database.",
            "Users can review.",
            "Edit and delete explored"
        ],
        "detailDescriptions": [
            "Basically this is a website where I am promoting my music teaching service.",
            "When they visit this site they can see the first three services of the database which were added newly.",
            "Clicking 'See All Services' they can see all the services.",
            "There is a button called 'View Details' where they can see all the details.",
            "There is a section of review.",
            "If users logged in then they can see the reviews and they have a text field to add reveiw. But if the not logged in then they have to log in first.",
            "There is an add service page where I can add more services.",
            "There a route called 'My Reviews' from where they can see the reviews added by only them. They can edit and delete the reviews from there."
        ]
    },

    {
        "_id": "03",
        "title": "C School",
        "live": "https://assignment-10-40242.web.app/",
        "client": "https://github.com/grsagor/c-school-client",
        "server": "https://github.com/grsagor/c-school-server",
        "imgs": [
            "https://i.ibb.co/71Bk6gv/1.png",
            "https://i.ibb.co/VjWMqdg/2.png",
            "https://i.ibb.co/b3847xs/3.png"
        ],
        "thumbnail": "https://i.ibb.co/9ZCR3nb/c-school-thumbnail.jpg",
        "shortDescriptions": [
            "Toggle with login and signup.",
            "Private route explored.",
            "Route based on id explored."
        ],
        "detailDescriptions": [
            "In the home page you can see the welcome messasge.",
            "By clicking 'Tutorials' on the navbar you can see the tutorial list initially.",
            "To see the details of tutorial you have to click on the tutorial topic name.",
            "Every detail page there is a download button, by clicking this button you can download the whole details as a pdf.",
            "Bottom of the detail page there is a button called 'Get Premium Access', by clicking this button you will be redirect to the check out page where you can get the content name but you have to be logged in. If you are not logged in then you will be redirect to the log in page and after logging in successfully you will be redirect to the checkout page automatically.",
            "By clicking 'Blog' on the navbar you can get some questions answer.",
            "If you are logged in then in the right side of the navbar you can see your profile picture and a signout button. If you hover on the picture you will see your profile name. If you are not logged in then you can see two button in the right side of the navbar called 'Log In', and 'Sign Up'.",
            "There will always be a toggle button for turning on dark theme."
        ]
    }
]